KooleControls/Thermostat/sdkconfig.defaults
# Target — both supported boards are ESP32-S3. Setting this here makes a bare
# CMake configure (e.g. the IDE build task) pick esp32s3 without a manual
# `idf.py set-target`. The component manager also reads it for dependency
# resolution (esp_lcd_st7701 / cst816s only publish esp32s3/p4 variants).
CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size and speed (ESP32-8048S043 has 16 MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM — ESP32-S3 N16R8: 8 MB octal PSRAM @ 80 MHz (LCD framebuffer lives here)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# HTTP server WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# Increase timer task stack (default 2048 too small for WiFi calls in timer callbacks)
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# FAT long filename support (needed for React build output)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# MQTT
CONFIG_MQTT_PROTOCOL_311=y

# OTA rollback — pairs with esp_ota_mark_app_valid_cancel_rollback() in main.cpp
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# LVGL — extra Montserrat font sizes used by the UI (14 is the only default)
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Bluetooth - BLE link to the KC1245 gateway (NimBLE peripheral)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# 240 MHz - the 800x480 RGB panel streaming from PSRAM is marginal at the 160 MHz default
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# RGB panel stability: re-sync the LCD DMA every VBlank so a desync self-heals
# (fixes the 'image jumps/shifts' artifact), and run code from PSRAM so flash
# writes (NVS/FAT) no longer stall the bounce-buffer refill.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# RGB panel stability, round 2: keep the bounce-buffer refill ISR and GDMA
# control paths in IRAM so cache misses can never starve the panel feed.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_GDMA_ISR_IRAM_SAFE=y

# Move the NimBLE host allocations to PSRAM. The internal-RAM draw buffer +
# IRAM-safe LCD/GDMA paths squeezed internal DRAM enough that the HTTP server
# task could no longer allocate its stack; this frees it back up.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
